/*
C语言学习
初认操作符
ByD菌
*/

#include <stdio.h>



////除法操作符 / ,取模操作符 %
////除法算出带余除法中的商,取余算出余数
////当使用浮点数除法时,需要将除数或被除数带小数位.0
////取模左操作数和右操作数只能为int类型
//int main ()
//{
//	int a = 5 / 2; //商2余1
//	int b = 5 % 2;
//	printf ("5/2 = %d\n5%2 = %d\n", a,b);
//	double c = 5 / 2.0;
//	printf ("5/2.0 = %lf", c);
//	return 0;
//}

//移位操作符>> <<
//int main ()
//{
//	int a = 16;
//	//移动二进制位
//	//>> 右移操作符
//	//1.算术右移
//	//右端丢弃,左边补原符号位
//	//2.逻辑右移
//	//右边丢弃,左边补0
//	//00000000000000000000000000010000 = 16
//	//00000000000000000000000000001000 = 8 (a >> 1)
//	//00000000000000000000000000000100 = 4 (a >> 2)
//	int b = a >> 1;
//	a = -1;
//	//整数的二进制有 原码 反码 补码
//	//储存到内存的是补码
//	//10000000000000000000000000000001 - 原码
//	//11111111111111111111111111111110 - 反码
//	//11111111111111111111111111111111 - 补码 
//	//<< 左移同理。
//}
//&按位与
//注意按补码按位与
//| 按位或
//^ 按位异或


//int main ()
//{
//	int a = 0
//		int* p = &a //取地址&
//		*p = 20 //解引用*
//		printf ("%d", *p);
//}
